; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image6 - mode
	thermograph1 - mode
	spectrograph0 - mode
	infrared4 - mode
	spectrograph2 - mode
	infrared5 - mode
	image3 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image3)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph1)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument5 infrared4)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument6 thermograph1)
	(supports instrument6 image3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared5)
	(supports instrument7 image6)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 thermograph1)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Planet7)
	(have_image Planet6 spectrograph2)
	(have_image Planet6 infrared5)
	(have_image Planet7 infrared5)
	(have_image Planet7 infrared4)
	(have_image Star8 infrared5)
	(have_image Star8 image3)
	(have_image Phenomenon9 image6)
	(have_image Phenomenon9 thermograph1)
	(have_image Phenomenon10 image6)
	(have_image Star11 infrared4)
))

)

; plan
1. (turn_to satellite3 groundstation5 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 12
3. (calibrate satellite3 instrument7 groundstation5)
   added: (calibrated instrument7)
   goals met: 0 of 12
4. (turn_to satellite3 star8 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star8)
   goals met: 0 of 12
5. (take_image satellite3 star8 instrument7 infrared5)
   added: (have_image star8 infrared5)
   goals met: 1 of 12
6. (turn_to satellite3 phenomenon9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 12
7. (take_image satellite3 phenomenon9 instrument7 image6)
   added: (have_image phenomenon9 image6)
   goals met: 2 of 12
8. (turn_to satellite3 phenomenon10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 12
9. (turn_to satellite2 groundstation0 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 12
10. (turn_to satellite1 groundstation5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation5)
   goals met: 2 of 12
11. (take_image satellite3 phenomenon10 instrument7 image6)
   added: (have_image phenomenon10 image6)
   goals met: 3 of 12
12. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 12
13. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 12
14. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 3 of 12
15. (calibrate satellite1 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 3 of 12
16. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 12
17. (turn_to satellite1 phenomenon9 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 12
18. (take_image satellite1 phenomenon9 instrument4 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 5 of 12
19. (turn_to satellite1 star8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star8)
   goals met: 5 of 12
20. (take_image satellite1 star8 instrument4 image3)
   added: (have_image star8 image3)
   goals met: 6 of 12
21. (turn_to satellite1 planet7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet7)
   goals met: 7 of 12
22. (turn_to satellite2 planet6 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet6)
   goals met: 7 of 12
23. (take_image satellite2 planet6 instrument5 infrared5)
   added: (have_image planet6 infrared5)
   goals met: 8 of 12
24. (take_image satellite2 planet6 instrument5 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 9 of 12
25. (turn_to satellite2 planet7 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet7)
   goals met: 9 of 12
26. (take_image satellite2 planet7 instrument5 infrared4)
   added: (have_image planet7 infrared4)
   goals met: 10 of 12
27. (take_image satellite2 planet7 instrument5 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 11 of 12
28. (turn_to satellite2 star11 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star11)
   goals met: 11 of 12
29. (take_image satellite2 star11 instrument5 infrared4)
   added: (have_image star11 infrared4)
   goals met: 12 of 12
